In [ ]:
# Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42.
# Then, print the series.

In [1]:
import pandas as pd

sr1 = pd.Series([4, 8, 15, 16, 23,42])
sr1

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [ ]:
# Q2. Create a variable of list type containing 10 elements in it, 
# and apply pandas.Series function on the variable print it.

In [12]:
sit = ['a','m','r','i','t', 1,2,3,4,5]
sr2 = pd.Series(sit)
sr2

0    a
1    m
2    r
3    i
4    t
5    1
6    2
7    3
8    4
9    5
dtype: object

In [ ]:
# Q3. Create a Pandas DataFrame that contains the following data: Then, print the DataFrame.

In [3]:
df3 = pd.DataFrame([['Alice',25,'Female'],['Bob',30,'Male'],['Claire',27,'Female']], columns=['Name', 'Age', 'Gender'])
df3

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [ ]:
Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.
Pandas DataFrame is a widely used data structure which works with a two-dimensional array with labeled axes (rows and columns).
DataFrame is defined as a standard way to store data that has two different indexes, i.e., row index and column index.
Series is defined as a one-dimensional array that is capable of storing various data types. The row labels of series are called the index. We can easily convert the list, tuple, and dictionary into series using "series' method

In [4]:
import pandas as pd

# Series
pd.Series([1, 2, 3, 4, 5])

# Dataframe
pd.DataFrame([[2,4,6],[10,20,30],['A','B','C']])

    0   1   2
0   2   4   6
1  10  20  30
2   A   B   C

In [ ]:
# Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame?
# Can you give an example of when you might use one of these functions?

In [5]:
df1 = pd.DataFrame([[2,4,6],[10,20,30],['A','B','C']])
df1

    0   1   2
0   2   4   6
1  10  20  30
2   A   B   C

In [13]:
df1 = pd.Series([[2,4,6],[10,20,30],['A','B','C']])
df1

0       [2, 4, 6]
1    [10, 20, 30]
2       [A, B, C]
dtype: object

In [6]:
## Rename - column and index
df1.index=['one','two', 'three']
df1.columns=['price','age','value']
df1

      price age value
one       2   4     6
two      10  20    30
three     A   B     C

In [7]:
# Print first 2 dataset
df1.head(2)

    price age value
one     2   4     6
two    10  20    30

In [8]:
# Print last 2 dataset
df1.tail(2)

      price age value
two      10  20    30
three     A   B     C

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?
All pandas data structures are value-mutable (the values they contain can be altered) but not always size-mutable.

Series - Size Immutable, Values Mutable
DataFrame - Size Mutable, Values Mutable
Panel - Size Mutable, Values Mutable

In [ ]:

# Q7. Create a DataFrame using multiple Series. Explain with an example.

In [9]:
import pandas as pd

s1  = pd.Series(['4 cups', '1 cup', '2 large', '1 can'])
s2  = pd.Series(['Flour', 'Milk', 'Eggs', 'Spam'])
print(type(s1), type(s2))

<class 'pandas.core.series.Series'> <class 'pandas.core.series.Series'>

In [10]:
pd.DataFrame([s2,s1])

        0      1        2      3
0   Flour   Milk     Eggs   Spam
1  4 cups  1 cup  2 large  1 can